app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_produtu`
SELECT COUNT(*) AS `numrows`
FROM `tbl_order`
SELECT COUNT(*) AS `numrows`
FROM `tbl_kontraktu`
SELECT COUNT(*) AS `numrows`
FROM `tbl_pagamentu`
---
    public function index()
    {
        $produto = new M_Produtu();
        $order = new M_Order();
        $kontraktu = new M_Kontraktu();
        $pagamentu = new M_Pagamentu();

        $data = [
            'total_produto'   => $produto->countAllResults(),
            'total_order'     => $order->countAllResults(),
            'total_kontraktu' => $kontraktu->countAllResults(),
            'total_pagamentu' => $pagamentu->countAllResults(),
        ];