app/Controllers/Kategoria.php

SELECT *
FROM `tbl_kategoria`
---
    public function index()
    {

        $data['kategoria'] = $this->kategoria->findAll();