app/Controllers/Order.php

    public function index()
    {
        $orderModel = new \App\Models\M_Order();

        $data['order'] = $orderModel
            ->select('tbl_order.id_order, tbl_costumer.naran, tbl_produtu.naran_produtu, tbl_order.presu, tbl_order.kuantidade, tbl_order.total_presu')
            ->join('tbl_costumer', 'tbl_costumer.id_costumer = tbl_order.id_costumer')
            ->join('tbl_produtu', 'tbl_produtu.id_produtu = tbl_order.id_produtu')
            ->findAll();
---
SELECT `tbl_order`.`id_order`, `tbl_costumer`.`naran`, `tbl_produtu`.`naran_produtu`, `tbl_order`.`presu`, `tbl_order`.`kuantidade`, `tbl_order`.`total_presu`
FROM `tbl_order`
JOIN `tbl_costumer` ON `tbl_costumer`.`id_costumer` = `tbl_order`.`id_costumer`
JOIN `tbl_produtu` ON `tbl_produtu`.`id_produtu` = `tbl_order`.`id_produtu`