app/Controllers/Pagamentu.php

SELECT `tbl_pagamentu`.`id_pagamentu`, `tbl_costumer`.`naran`, `tbl_pagamentu`.`osan`, `tbl_pagamentu`.`data_pagamentu`, `tbl_pagamentu`.`estatutu`, `tbl_pagamentu`.`data_atualiza`
FROM `tbl_pagamentu`
JOIN `tbl_costumer` ON `tbl_costumer`.`id_costumer` = `tbl_pagamentu`.`id_costumer`
---
    public function index()
    {
        $pagamentuModel = new \App\Models\M_Pagamentu();

        $data['pagamentu'] = $pagamentuModel
            ->select('tbl_pagamentu.id_pagamentu, tbl_costumer.naran, tbl_pagamentu.osan, tbl_pagamentu.data_pagamentu, tbl_pagamentu.estatutu, tbl_pagamentu.data_atualiza')
            ->join('tbl_costumer', 'tbl_costumer.id_costumer = tbl_pagamentu.id_costumer')
            ->findAll();