app/Controllers/Produtu.php

    public function index()
    {
        $produtuModel = new \App\Models\M_Produtu();

        $data['produtu'] = $produtuModel
            ->select('tbl_produtu.id_produtu,  tbl_produtu.naran_produtu,  tbl_kategoria.naran_kategoria,  tbl_produtu.presu')
            ->join('tbl_kategoria', 'tbl_kategoria.id_kategoria = tbl_produtu.id_kategoria')
            ->findAll();
---
SELECT `tbl_produtu`.`id_produtu`, `tbl_produtu`.`naran_produtu`, `tbl_kategoria`.`naran_kategoria`, `tbl_produtu`.`presu`
FROM `tbl_produtu`
JOIN `tbl_kategoria` ON `tbl_kategoria`.`id_kategoria` = `tbl_produtu`.`id_kategoria`